[
  {
    "id": "2026030476339675212",
    "text": "Key to be a successful investor: \"You have to learn to change your mind when you're wrong.\"\n\nWhen you believe in a company or management team but it doesn’t deliver you need to learn to move on. https://t.co/GnlpWQafhU",
    "createdAt": "Mon Feb 23 20:24:42 +0000 2026",
    "replyCount": 6,
    "retweetCount": 7,
    "likeCount": 141,
    "conversationId": "2026030476339675212",
    "author": {
      "username": "alojoh",
      "name": "AJ Investment Research"
    },
    "authorId": "2897852237",
    "media": [
      {
        "type": "video",
        "url": "https://pbs.twimg.com/amplify_video_thumb/2026030413613850624/img/7W4WrIXeo6qzvdoP.jpg",
        "width": 1280,
        "height": 720,
        "previewUrl": "https://pbs.twimg.com/amplify_video_thumb/2026030413613850624/img/7W4WrIXeo6qzvdoP.jpg:small",
        "videoUrl": "https://video.twimg.com/amplify_video/2026030413613850624/vid/avc1/1280x720/d34e3YuK8qsvOQcC.mp4?tag=21",
        "durationMs": 71226
      }
    ]
  },
  {
    "id": "2026019035561803938",
    "text": "RT @nvidia: New benchmarks from @SGLang show NVIDIA Blackwell Ultra GB300 racks raising the bar for long-context #opensource inference achi…",
    "createdAt": "Mon Feb 23 19:39:14 +0000 2026",
    "replyCount": 0,
    "retweetCount": 1,
    "likeCount": 0,
    "conversationId": "2026019035561803938",
    "author": {
      "username": "alojoh",
      "name": "AJ Investment Research"
    },
    "authorId": "2897852237"
  },
  {
    "id": "2026009072105910743",
    "text": "This is what modern AI espionage looks like",
    "createdAt": "Mon Feb 23 18:59:38 +0000 2026",
    "replyCount": 1,
    "retweetCount": 5,
    "likeCount": 91,
    "conversationId": "2026009072105910743",
    "author": {
      "username": "alojoh",
      "name": "AJ Investment Research"
    },
    "authorId": "2897852237"
  },
  {
    "id": "2026008870489936055",
    "text": "RT @AnthropicAI: We’ve identified industrial-scale distillation attacks on our models by DeepSeek, Moonshot AI, and MiniMax.\n\nThese labs cr…",
    "createdAt": "Mon Feb 23 18:58:50 +0000 2026",
    "replyCount": 0,
    "retweetCount": 4792,
    "likeCount": 0,
    "conversationId": "2026008870489936055",
    "author": {
      "username": "alojoh",
      "name": "AJ Investment Research"
    },
    "authorId": "2897852237"
  },
  {
    "id": "2025929724388610303",
    "text": "NEWS: Uber announces \"Autonomous Solutions\" and tries to position itself as a critical infrastructure provider. \n\nUber is leveraging its driving data, global demand network, operational infrastructure, regulatory relationships, and fleet management capabilities to become the default go-to-market layer for autonomous vehicle developers. \n\nIn a market where scaling, utilization, and cost per mile will determine winners, Uber tries to position itself as critical infrastructure for autonomy as vehicle OEMs and AV software players compete on the technology layer.\n\n***\nFebruary 23, 2026\nSAN FRANCISCO--(BUSINESS WIRE)-- Uber Technologies, Inc. (NYSE: UBER) today announced the launch of Uber Autonomous Solutions, a comprehensive suite of unique services and capabilities that are already helping partners to build and successfully commercialize autonomous vehicles in multiple markets around the world.\n\n“Autonomous technology has remarkable potential to make transportation safer and more affordable,” said Dara Khosrowshahi, CEO. “Innovation in autonomy is moving quickly, but meaningful commercialization will take much longer. For more than a decade, Uber has helped set the standard for on-demand mobility and built the capabilities that make ‘push a button and get a ride’ work at global scale. With Uber Autonomous Solutions, we’re externalizing these hard-won competencies for our partners.”\n\nBeyond just getting access to Uber’s leading demand marketplace, Uber Autonomous Solutions goes further—providing the capabilities required for true end-to-end commercialization, reducing cost per mile while increasing speed to market. They also bring comprehensive product development and support capabilities, designed to make autonomous trips more reliable for users and more economical for operators.\n\n“AV tech teams should be able to focus on what they do best: building software that can safely power an autonomous world,” said Sarfraz Maredia, Global Head of Autonomous Mobility and Delivery. “Uber Autonomous Solutions is designed to complement their strengths by providing operational depth wherever they need it–whether that’s demand generation, rider experience, customer support, or managing the day-to-day realities of running a real-world fleet. When partners plug into Uber’s network, they can scale more efficiently, operate more reliably, and move faster.”\n\nUber Autonomous Solutions is organized across three areas: infrastructure, user experience, and fleet operations.\n\nInfrastructure solutions\n\nAutonomous vehicles can’t hit the road without the right infrastructure. Uber provides the digital and physical foundations—combining data, mapping, regulatory access, and financing–to help partners deploy autonomy smoothly at scale.\n\nAV 2.0 Training Data\nUber’s data-collection fleet includes thousands of specially-equipped vehicles across dozens of cities, which has captured millions of diverse miles of easily searchable multi-sensor data across the US and Europe. Working closely with engineers from Uber AV Labs, and building on partnerships like our Data Factory with NVIDIA, we’re helping our AV partners train their models and scale toward Level 4 autonomy much faster.\nData-Enriched Mapping\nInformed by tens of billions of trips worldwide and our own in-house mapping solutions, Uber’s dynamic geospatial data help AV partners refine pickups, routing, and ETAs with real-world precision, whether that’s avoiding specific intersections during rush hour or mitigating fleet-wide risks from weather and sudden road closures. Custom APIs help ensure AVs are always in the right places at the right time, even as Operational Design Domains evolve, continually driving both better utilization and a superior rider experience.\nComplex Venue and Event Management\nWith millions of trips completed at airports, stadiums, and event venues, Uber has developed unique data on the complexity of these high-traffic environments and how to ensure a good experience for riders. We are also leveraging existing relationships to work directly with high-traffic venues, like Q2 Stadium in Austin, to optimize venues appropriately for both human- and AV-driven rideshare.\nRegulatory Support\nUber’s global policy and regulatory support teams have deep experience and trusted relationships to help bring new technology to markets all over the world, which will be crucial for the commercialization of autonomous technology.\nFleet Financing\nOur scale and predictable demand support new models for AV asset financing, helping partners bring more vehicles and new autonomous form factors to the road faster.\nUser experience solutions\nBringing AVs to full-scale adoption will require the kind of end-to-end user experience Uber is known for. With a large global footprint and over a decade of expertise, we’re helping partners deliver the autonomous products customers demand.\nIn-Car Experience\nDrawing from our best-in-class product design, Uber has developed an in-car AV-first software interface that puts riders in control, with seamless access to sound, temperature, and rider assistance. Designed to work across different hardware configurations and deployments, this unified experience creates a consistent user experience for riders. Launching later this year, the Nuro-Lucid-Uber robotaxi will be the first AV to bring this experience to its in-car tablets, seamlessly integrating Nuro’s real-time driving visualization.\nComplex Use Cases\nPreparing autonomy for real-world demand will require a diversified product offering. Building on our experience with UberX Share and Uber Reserve, we’re helping autonomous partners develop new products that provide the reliability riders expect, offering the demand density, flexible supply, and regulatory support necessary to make these products possible. We already offer AVs through Uber Reserve in Phoenix, and were the first to announce a shared AV product with Volkswagen, launching later this year in Los Angeles.\nEnd-to-End Support\nUber’s customer support network is built into every stage of the journey. From pre-trip to post-trip, riders can access real-time help with the tap of a button, powered by the same infrastructure that supports more than a billion trips each month worldwide.\nFleet operations solutions\n\nSuccessful autonomous commercialization requires that AV fleets run at peak efficiency. With depot tooling, AV-specific insurance, and real-time insights, Uber keeps fleet operators informed and in control, so their operations experience less interruption.\n\nAV Mission Control\nUber designed and built a comprehensive fleet intelligence and management solution that gives operators a real-time view of every vehicle, turning dozens of per-AV status indicators into system-level insight that keeps fleets efficient, connected, and ready to move. The system's supply-state machine constantly ingests raw telemetry and signals from the AV fleet, determining a vehicle's precise status, then uses an intelligent orchestration layer to help tee up possible actions or human interventions. This process is governed by a command authority system that strictly arbitrates who can issue commands, while providing a complete supply-history ledger for auditability.\nRemote Assistance\nIn a perfect world, AVs would never need help. In the real world, Uber provides real-time, on-road support for riders when AVs encounter issues, monitoring situations and providing live communication to the rider and the ADS itself. Additionally, we are designing a new remote assistance platform, built on top of our end-to-end support capabilities, and powered through a custom agent console that provides the operator with everything they need to understand the AV’s status and take action.\nField Support Operations\nLive today in multiple markets, our field support teams manage in-field issues, like lost items, towing, manual assistance, cleaning, or alternate rides to keep every trip moving–all visible through AV Mission Control. Where appropriate, we’ll also leverage our hybrid network, whether that’s returning a lost item through a courier, or seamlessly dispatching a human driver during inclement weather.\nAV Insurance\nUber’s industry-first insurance program is built for the realities of autonomous operations. All aspects of an AV deployment require bespoke coverage, whether the vehicle is on-trip, off-trip, or charging at a depot. Uber’s Autonomous Vehicle Insurance Policy brings together protection for manufacturers, ADS providers, owners, fleet managers, and other supporting participants into one simple policy that is backed by several of the largest names in the insurance industry.\nAs autonomy advances, the defining challenge will be turning this incredible technology into a scaled service people can trust, every day, and in every kind of environment. Uber Autonomous Solutions is built to bridge the gap between breakthroughs and ubiquity, helping partners to launch faster, operate more reliably, and scale more efficiently, with the effortless user experience riders have come to expect from Uber.\n“Scaling autonomous ride-hailing requires more than vehicle technology—it requires strong operational insight and customer support,” said Dmitry Polishchuk, CEO at Avride. “Uber’s platform data helps inform deployment decisions and ODD expansion, making sure autonomous vehicles are introduced where they can deliver the greatest value to riders. Combined with Uber’s robust rider support infrastructure, this creates the operational foundation needed to scale reliably.”\n\"Nuro’s universal autonomy platform enables our partners to scale autonomy responsibly, and a rider-centric experience is critical to achieving full-scale consumer trust and adoption,\" said Andrew Chapin, COO at Nuro. \"Uber has done excellent work designing an in-vehicle experience that will deliver the intuitive in-car interface riders expect. Nuro is proud to help bring that experience to life by integrating our real-time driving visualization into the Nuro-Lucid-Uber robotaxi.\"\n\n“Wayve’s AV2.0 approach is built on learning directly from real-world data,” said Kaity Fischer, VP Commercial and Operations at Wayve. “Our foundation model architecture allows us to unlock value from large-scale, diverse datasets to power any vehicle, anywhere, safely at scale. Uber’s multi-sensor and dash cam data across global markets adds critical diversity and complexity to our training, accelerating commercialization and helping turn breakthrough AI into products people can trust.”\n\n“Our partnership with Uber reflects how WeRide’s advanced L4 autonomous driving technology can be deployed at scale through proven operational performance across international markets,” said Dr. Tony Han, Founder and CEO at WeRide. “WeRide delivers a fully integrated autonomous solution spanning the AV stack, vehicle integration, and large-scale fleet operations to support safe, reliable, fully driverless Robotaxi services. Uber Autonomous Solutions complements these capabilities by supporting demand generation, rider experience, and customer operations. Together, this collaboration enables commercial Robotaxi deployments in cities including Abu Dhabi, Dubai, and Riyadh.”",
    "createdAt": "Mon Feb 23 13:44:20 +0000 2026",
    "replyCount": 5,
    "retweetCount": 6,
    "likeCount": 27,
    "conversationId": "2025929724388610303",
    "author": {
      "username": "alojoh",
      "name": "AJ Investment Research"
    },
    "authorId": "2897852237",
    "media": [
      {
        "type": "photo",
        "url": "https://pbs.twimg.com/media/HB2LbqMX0AAGwYZ.png",
        "width": 480,
        "height": 270,
        "previewUrl": "https://pbs.twimg.com/media/HB2LbqMX0AAGwYZ.png:small"
      }
    ]
  },
  {
    "id": "2025923612260089881",
    "text": "This was the most elaborate hedge fund ploy ever executed. \nhttps://t.co/pSbfwrIL9z",
    "createdAt": "Mon Feb 23 13:20:03 +0000 2026",
    "replyCount": 0,
    "retweetCount": 2,
    "likeCount": 45,
    "conversationId": "2025923612260089881",
    "author": {
      "username": "alojoh",
      "name": "AJ Investment Research"
    },
    "authorId": "2897852237",
    "quotedTweet": {
      "id": "1883796050412273891",
      "text": "I have to applaud the Chinese hedge fund (High Flyer) behind Deepseek: they pulled off one of the most elaborate shortseller campaigns I have ever seen: \n\n1. As AI hype kicks off, set up an AI team to tinker around and find something which looks to laymen like a \"game changer\".",
      "createdAt": "Mon Jan 27 08:35:52 +0000 2025",
      "replyCount": 83,
      "retweetCount": 94,
      "likeCount": 762,
      "conversationId": "1883796050412273891",
      "author": {
        "username": "alojoh",
        "name": "AJ Investment Research"
      },
      "authorId": "2897852237"
    }
  }
]
