[
  {
    "id": "2024564270122652107",
    "text": "South Africa’s labour market is at a critical crossroads. The country cannot grow sustainably while millions remain locked out of work, and we cannot solve unemployment without fixing the skills-to-demand gap and accelerate real pathways.\n\nIn his response to SONA 2026 questions, today President @CyrilRamaphosa reinforced the urgency of tackling unemployment and strengthening demand-led skills that match what the economy needs (including critical technical and professional skills), through coordinated action across government, business, education, and society.\n\nAt the same time, the latest labour force data released by Statistics South Africa confirms that unemployment remains among the highest in the world, with more than 31% of the labour force still unemployed — disproportionately affecting young people and those attempting to transition from learning into work.\n\nThese trends underscore a shared national imperative that, we must move beyond dialogue to measurable action on skills, jobs and inclusive labour market participation.\n\nSince 2025, Career Indaba® has been coordinating a structured national response to this priority. The Career Indaba® Expo & Bootcamp (15–16 May 2026) serves as South Africa’s National Employment & Skills Network, convening employers, education institutions, policymakers, organised labour, learners and job seekers within a coordinated environment focused on practical workforce progression.\n\nThrough this national gathering, we aim to strengthen school-to-work transitions, reduce labour market fragmentation and expand equitable access to sector-aligned skills pathways, employment opportunities, learnership programmes, bursary funding and structured training routes.\n\nThe time to make a shift from commitment to taking action is now. If your organisation is committed to transforming policy intent into measurable impact, this is the moment to align with the journey of building a more inclusive and economically resilient South Africa.\n\n#SONA2026 #Employment #SkillsDevelopment #YouthEmployment #DemandLedSkills #CareerIndaba #SouthAfrica #StatsSA #SkillsMismatch #NationalEmploymentAndSkills #leadership #Industry #Sector #Education\nhttps://t.co/yxzrxLSFKw",
    "createdAt": "Thu Feb 19 19:18:31 +0000 2026",
    "replyCount": 0,
    "retweetCount": 0,
    "likeCount": 0,
    "conversationId": "2024564270122652107",
    "author": {
      "username": "CareerIndaba",
      "name": "#Career Indaba®"
    },
    "authorId": "1185511604772839425",
    "media": [
      {
        "type": "video",
        "url": "https://pbs.twimg.com/amplify_video_thumb/2024563889241825280/img/0HylxQZpIWRnLpEm.jpg",
        "width": 1200,
        "height": 1200,
        "previewUrl": "https://pbs.twimg.com/amplify_video_thumb/2024563889241825280/img/0HylxQZpIWRnLpEm.jpg:small",
        "videoUrl": "https://video.twimg.com/amplify_video/2024563889241825280/vid/avc1/1080x1080/vOiX2FIKDiTmt6H2.mp4?tag=21",
        "durationMs": 28244
      }
    ]
  },
  {
    "id": "2024130637783765214",
    "text": "#CareerPathways in the #Fintech and #Mobility sector.\nJamie Wyngaard’s career reflects a modern African innovation journey moving between entrepreneurship, design thinking, fintech, and infrastructure-building, while keeping people at the centre of every solution.\n\nAs Co-Founder and CXO of Loop, his work sits at the intersection of mobility and money, building cashless payment systems and inclusive mobility infrastructure designed for real-world African conditions, not ideal ones.\n\nThis feature explores what it means to build technology for emerging markets where innovation is not defined by novelty, but by access, dignity, and practical problem-solving at scale.\n\nFeatured in Career Indaba® Magazine’s inaugural edition.\n👉 Read the full career memoir https://t.co/Ez1W9sDuCA \n\n#CareerIndabaMagazine #LabourMarketIntelligence #CareerArchive #FinancialInclusion #DigitalPayments #DesignThinking #FutureOfWork #TimelessCareerLegacy",
    "createdAt": "Wed Feb 18 14:35:25 +0000 2026",
    "replyCount": 0,
    "retweetCount": 0,
    "likeCount": 0,
    "conversationId": "2024130637783765214",
    "author": {
      "username": "CareerIndaba",
      "name": "#Career Indaba®"
    },
    "authorId": "1185511604772839425",
    "media": [
      {
        "type": "photo",
        "url": "https://pbs.twimg.com/media/HBcn9gSXwAAH5rr.jpg",
        "width": 1200,
        "height": 1200,
        "previewUrl": "https://pbs.twimg.com/media/HBcn9gSXwAAH5rr.jpg:small"
      }
    ]
  },
  {
    "id": "2024130419545792786",
    "text": "#CareerPathways in the #Technology and #DigitalSystems sector.\nOsvaldo Museta’s career has not followed a straight line. It has moved through detours, reinventions, and deliberate pivots from a Zimbabwean childhood shaped by constraint and longing, to global digital consulting and automation systems work.\n\nNow an Automation Systems Specialist at Titan Network, his journey reflects the modern labour market: self-directed learning, cross-border collaboration, remote work, and the ability to translate diverse skills into systems thinking.\n\nThis feature explores imposter syndrome, burnout, unemployment, and professional reinvention, and what it means to move from searching for belonging to building impact across industries.\n\nFeatured in Career Indaba® Magazine’s inaugural edition.\n👉 Read the full career memoir: https://t.co/ELtMO1OLzu\n\n#CareerIndabaMagazine #LabourMarketIntelligence #Automation #DigitalTransformation #FutureOfWork #TimelessCareerLegacy",
    "createdAt": "Wed Feb 18 14:34:33 +0000 2026",
    "replyCount": 0,
    "retweetCount": 0,
    "likeCount": 0,
    "conversationId": "2024130419545792786",
    "author": {
      "username": "CareerIndaba",
      "name": "#Career Indaba®"
    },
    "authorId": "1185511604772839425",
    "media": [
      {
        "type": "photo",
        "url": "https://pbs.twimg.com/media/HBcngyOXQAAIw9B.jpg",
        "width": 1200,
        "height": 1200,
        "previewUrl": "https://pbs.twimg.com/media/HBcngyOXQAAIw9B.jpg:small"
      }
    ]
  },
  {
    "id": "2024129950274478377",
    "text": "#CareerPathways in the #Engineering and #Manufacturing sector.\nFrom the rural paths of iMpendle to leading engineering strategy at JA Engineering Works (Pty) Ltd, Mthobisi Zuma has built a career defined by endurance, discipline, and the ability to deliver results under pressure.\n\nRaised by his grandmother after losing both parents at a young age, his story reflects how careers are shaped not only by education and opportunity, but by resilience, leadership judgement, and the environments professionals must navigate to progress.\n\nToday, as Head of Engineering, his journey offers insight into leadership across difference, workforce mobility, and what it means to remain grounded while rising through highly technical and performance-driven industries.\n\nFeatured in Career Indaba® Magazine’s inaugural edition.\n👉 Read the full career memoir https://t.co/sqJEZGPAPD\n\n#CareerIndabaMagazine #LabourMarketIntelligence #LeadershipDevelopment #CareerArchive #WorldOfWork #TimelessCareerLegacy",
    "createdAt": "Wed Feb 18 14:32:41 +0000 2026",
    "replyCount": 0,
    "retweetCount": 0,
    "likeCount": 0,
    "conversationId": "2024129950274478377",
    "author": {
      "username": "CareerIndaba",
      "name": "#Career Indaba®"
    },
    "authorId": "1185511604772839425",
    "media": [
      {
        "type": "photo",
        "url": "https://pbs.twimg.com/media/HBcnBFWW4AEDAPN.jpg",
        "width": 1200,
        "height": 1200,
        "previewUrl": "https://pbs.twimg.com/media/HBcnBFWW4AEDAPN.jpg:small"
      }
    ]
  },
  {
    "id": "2022307176396538231",
    "text": "RT @DenzilTaylor: One of the coolest dudes … ⁦@Powerfm987⁩ https://t.co/N3lHi9IlrV",
    "createdAt": "Fri Feb 13 13:49:38 +0000 2026",
    "replyCount": 0,
    "retweetCount": 2,
    "likeCount": 0,
    "conversationId": "2022307176396538231",
    "author": {
      "username": "CareerIndaba",
      "name": "#Career Indaba®"
    },
    "authorId": "1185511604772839425",
    "media": [
      {
        "type": "photo",
        "url": "https://pbs.twimg.com/media/HBCHH6BWUAEbS-x.jpg",
        "width": 1536,
        "height": 2048,
        "previewUrl": "https://pbs.twimg.com/media/HBCHH6BWUAEbS-x.jpg:small"
      }
    ]
  },
  {
    "id": "2022307097581355460",
    "text": "RT @AB_Broadcaster: 16 years.\n4 radio stations.\nCountless shows. Countless lives touched.\nFrom rookie dreams to award-winning moments… Radi…",
    "createdAt": "Fri Feb 13 13:49:19 +0000 2026",
    "replyCount": 0,
    "retweetCount": 11,
    "likeCount": 0,
    "conversationId": "2022307097581355460",
    "author": {
      "username": "CareerIndaba",
      "name": "#Career Indaba®"
    },
    "authorId": "1185511604772839425"
  },
  {
    "id": "2020847091581354343",
    "text": "#CareerPathways in the #Financial #Services, Actuarial Science & Retirement Systems sector. In a financial system under pressure, true leadership is measured not only by technical precision, but by the lives it safeguards. #Meeta Gosai’s career as an actuary at Momentum Corporate is shaped by discipline, faith, and an unwavering commitment to people.\n\nOver years of deliberate growth, she has helped design retirement solutions that prioritise clarity, trust, and dignity while leading teams with humanity in one of South Africa’s most complex financial arenas. This is a career story about responsibility, long-term thinking, and leadership with heart.\n\n👉 Read the full career memoir at https://t.co/K9F87h7ZkA",
    "createdAt": "Mon Feb 09 13:07:46 +0000 2026",
    "replyCount": 0,
    "retweetCount": 0,
    "likeCount": 0,
    "conversationId": "2020847091581354343",
    "author": {
      "username": "CareerIndaba",
      "name": "#Career Indaba®"
    },
    "authorId": "1185511604772839425",
    "media": [
      {
        "type": "photo",
        "url": "https://pbs.twimg.com/media/HAt9GKpbkAAwDNf.jpg",
        "width": 1200,
        "height": 1200,
        "previewUrl": "https://pbs.twimg.com/media/HAt9GKpbkAAwDNf.jpg:small"
      }
    ]
  },
  {
    "id": "2020844668993343553",
    "text": "#CareerPathways in the #Financial #Services & #Property #Finance sector. For over two decades in property finance at Absa Group, SALLY GOUVEA has built a career defined not only by performance, but by integrity, ethical judgement, and deep client relationships.\n\nHer journey reflects what it means to lead with conviction in a numbers-driven industry, guiding families into homeownership, mentoring others, and proving that purpose and professionalism can coexist without compromise.\n\nThis is a career story about resilience, responsibility, and showing up with consistency when it matters most. Featured in Career Indaba® Magazine’s inaugural edition.\n\n👉 Read the full career memoir at https://t.co/jpE6Jmj52m",
    "createdAt": "Mon Feb 09 12:58:09 +0000 2026",
    "replyCount": 1,
    "retweetCount": 0,
    "likeCount": 0,
    "conversationId": "2020844668993343553",
    "author": {
      "username": "CareerIndaba",
      "name": "#Career Indaba®"
    },
    "authorId": "1185511604772839425",
    "media": [
      {
        "type": "photo",
        "url": "https://pbs.twimg.com/media/HAt7e3DaEAAkLb1.jpg",
        "width": 1200,
        "height": 1200,
        "previewUrl": "https://pbs.twimg.com/media/HAt7e3DaEAAkLb1.jpg:small"
      }
    ]
  },
  {
    "id": "2020844461983437059",
    "text": "#InsuranceSector South Africa’s insurance sector is entering a defining era shaped by digital transformation, AI-driven decision-making, climate risk, regulatory complexity, and shifting consumer expectations. In this environment, leadership is no longer about technical competence alone. It is about judgement, systems thinking, governance, and the ability to lead institutions through uncertainty.\n\nThis feature explores how @inseta - Insurance Sector Education and Training Authority, under the leadership of CEO Ms Gugu Mkhize, is strengthening the sector’s leadership pipeline through strategic partnerships with @HenleyBusinessSchool - Africa, @GIBS Business School (GordonInstitute of Business Science), and the Graduate School of Business - University of Cape Town. It is a timely example of how skills development, executive education, and institutional collaboration are becoming strategic levers for long-term sector sustainability\n\nDiscover how sector-led skills investment is strengthening insurance leadership pipelines. Click here https://t.co/Y6vQ7p6Cbs\n\n#CareerIndabaMagazine #InsuranceSector #LeadershipDevelopment #SkillsDevelopment #INSETA #FutureOfWork #WorkforceDevelopment",
    "createdAt": "Mon Feb 09 12:57:19 +0000 2026",
    "replyCount": 0,
    "retweetCount": 0,
    "likeCount": 0,
    "conversationId": "2020844461983437059",
    "author": {
      "username": "CareerIndaba",
      "name": "#Career Indaba®"
    },
    "authorId": "1185511604772839425",
    "media": [
      {
        "type": "photo",
        "url": "https://pbs.twimg.com/media/HAt0IXpawAA22he.jpg",
        "width": 1200,
        "height": 1200,
        "previewUrl": "https://pbs.twimg.com/media/HAt0IXpawAA22he.jpg:small"
      }
    ]
  },
  {
    "id": "2019409957930565788",
    "text": "#CareerPathways in #HumanCapital and #Transport sector.  #Mmabatho #Tlale (LLM)’s career reflects a modern African leadership journey, one where ambition is matched with humility, and systems are shaped with humanity at their core. \n\nFrom a Sepulana-rooted upbringing in Bushbuckridge to the executive corridors of @ZedaLimitedZA, her career path demonstrates how law, human capital, and lived experience can converge to widen opportunity and restore dignity in the workplace.\n\nAs Chief Human Capital Officer, Mmabatho has progressed from operational roles into strategic leadership, building cultures that align performance with purpose. Along the way, she has balanced executive responsibility, advanced legal studies culminating in an LLM in 2025, and motherhood without compromise. \n\nHer leadership has delivered tangible outcomes, including Top Employer Certification on the first attempt, award-winning wellness and engagement initiatives, and recognition as a leading voice in human capital strategy. At its core, her career is about people — how they are seen, developed, and trusted to thrive.\n\nIn this inaugural edition of Career Indaba® Magazine feature, Mmabatho reflects on resilience, intentional growth, and why Africa’s future of work must be both globally competitive and deeply humane.\n\n👉 Read the full feature in Career Indaba® Magazine https://t.co/4vnPl9BOtZ\n\n#CareerIndabaMagazine #CareerPathways #Leadership #AfricanEnterprise #WomenInLeadership",
    "createdAt": "Thu Feb 05 13:57:07 +0000 2026",
    "replyCount": 0,
    "retweetCount": 0,
    "likeCount": 0,
    "conversationId": "2019409957930565788",
    "author": {
      "username": "CareerIndaba",
      "name": "#Career Indaba®"
    },
    "authorId": "1185511604772839425",
    "media": [
      {
        "type": "photo",
        "url": "https://pbs.twimg.com/media/HAZhVJOWAAAiBw-.jpg",
        "width": 1200,
        "height": 1200,
        "previewUrl": "https://pbs.twimg.com/media/HAZhVJOWAAAiBw-.jpg:small"
      }
    ]
  },
  {
    "id": "2019408331060720122",
    "text": "#CareerPathways in #Finance, Capital & Enterprise Development. @CleolaKunene stands at the forefront of Africa’s small business economy, not as an observer, but as a system builder. \n\nAs Head of Small and Medium Enterprises at the Johannesburg Stock Exchange @JSE_Group, her work has reshaped how capital, policy, and opportunity intersect for entrepreneurs across the continent. From pioneering SME-focused market solutions within one of Africa’s most critical financial institutions, to contributing to global policy discourse through the G20, Cleola’s leadership reflects a rare combination of technical depth, strategic foresight, and unwavering commitment to economic dignity.\n\nIn this deeply personal career reflection, Cleola traces the landscapes, lessons, and clarity that have shaped her career journey — from navigating complex financial systems to advocating for inclusive enterprise growth. She reveals why championing Small and Medium Enterprises is not simply her profession, but a lifelong purpose rooted in enabling access, credibility, and sustainable opportunity.\n\nThis inaugural edition of Career Indaba® Magazine timeless career legacies feature offers insight into leadership at the intersection of finance and development and highlights the critical role SMEs play in shaping Africa’s economic resilience and future of work.\n\n👉 Read the full feature in Career Indaba® Magazine https://t.co/FB8AYzTcjY\n\n#CareerIndabaMagazine #CareerPathways #Leadership #AfricanEnterprise #WomenInLeadership",
    "createdAt": "Thu Feb 05 13:50:39 +0000 2026",
    "replyCount": 0,
    "retweetCount": 0,
    "likeCount": 0,
    "conversationId": "2019408331060720122",
    "author": {
      "username": "CareerIndaba",
      "name": "#Career Indaba®"
    },
    "authorId": "1185511604772839425",
    "media": [
      {
        "type": "photo",
        "url": "https://pbs.twimg.com/media/HAZgtiAXEAAH6LS.jpg",
        "width": 1200,
        "height": 1200,
        "previewUrl": "https://pbs.twimg.com/media/HAZgtiAXEAAH6LS.jpg:small"
      }
    ]
  },
  {
    "id": "2019407705803292951",
    "text": "#CareerPathways in #Education sector driven by entrepreneurship, purpose, and youth development. The late @IsaacMongali was building for Africa’s future while many were still debating it. As the founder of #CareerKit, his work was anchored in an urgent conviction that Africa’s talent must be seen, supported, and given #pathways to thrive.\n\nThis feature honours Isaac not as a career journey unfinished, but as a vision already in motion. Isaac’s leadership was defined by faith, precision, and an unwavering commitment to young people navigating education, work, and possibility in complex systems. In this rare and poignant instance, the career archive fulfils its purpose of preserving what mattered when time intervene. \n\nIsaac’s positive impact lives on through the organisation he built, the team he entrusted, and the thousands of young people whose futures he helped illuminate.\n\nThis inaugural edition of Career Indaba® Magazine timeless career legacies, this feature reflects on a career legacy that will live on — reminding us that meaningful careers are measured not only by longevity, but by purpose, reach, and the lives shaped along the way.\n\n👉 Read the full feature in Career Indaba® Magazine https://t.co/CztTEXRJXE\n\n#CareerIndabaMagazine #CareerPathways #Leadership #AfricanEnterprise",
    "createdAt": "Thu Feb 05 13:48:10 +0000 2026",
    "replyCount": 0,
    "retweetCount": 0,
    "likeCount": 0,
    "conversationId": "2019407705803292951",
    "author": {
      "username": "CareerIndaba",
      "name": "#Career Indaba®"
    },
    "authorId": "1185511604772839425",
    "media": [
      {
        "type": "photo",
        "url": "https://pbs.twimg.com/media/HAZfYPWW8AAVlub.jpg",
        "width": 1200,
        "height": 1200,
        "previewUrl": "https://pbs.twimg.com/media/HAZfYPWW8AAVlub.jpg:small"
      }
    ]
  },
  {
    "id": "2017214788745535921",
    "text": "#CareerPathways in #Sport. @sticks_andile’s career journey reflects excellence and resilience beyond the pitch. As a #Banyana #Banyana goalkeeper and professional footballer at #Mamelodi #Sundowns, her career path illustrates how sport can serve as a platform for national pride, leadership, and the advancement of women’s football in Africa.\n\nFeatured in Career Indaba® Magazine’s inaugural edition, her story offers perspective on discipline, recovery, and representation and the role athletes play in shaping opportunity for the next generation.\n\n👉 Read or listen to the full career memoir at https://t.co/Gj8suYHCFR\n#Leadership #sport #womeninsport #football #soccer #champion @Banyana_Banyana",
    "createdAt": "Fri Jan 30 12:34:18 +0000 2026",
    "replyCount": 0,
    "retweetCount": 0,
    "likeCount": 0,
    "conversationId": "2017214788745535921",
    "author": {
      "username": "CareerIndaba",
      "name": "#Career Indaba®"
    },
    "authorId": "1185511604772839425",
    "media": [
      {
        "type": "photo",
        "url": "https://pbs.twimg.com/media/G_6WJzYWAAA3FVX.jpg",
        "width": 1200,
        "height": 1200,
        "previewUrl": "https://pbs.twimg.com/media/G_6WJzYWAAA3FVX.jpg:small"
      }
    ]
  },
  {
    "id": "2017179411951309023",
    "text": "Sector-aligned #CareerPathways in the #Food #Services #Industry. The @KFCSA’s #Streetwise #Academy is an initiative that is demonstrating how employer-led skills development can translate entry-level work into nationally recognised qualifications, leadership pathways, and long-term employability. \n\nThe academy is a compelling example of how accredited workplace learning can address skills gaps, support youth progression, and strengthen workforce readiness within the quick service restaurant sector.\n\nFeaturing KFC Africa’s Streetwise Academy for its role in investing in people through accredited learning, and practical leadership development that converges to expand access to meaningful career pathways.\n\nThe Academy reflects how well-structured, accredited learning can unlock opportunity and build leadership capacity within the workforce.\n\n👉 Read the full feature at https://t.co/bP8fDoNPDD\n#CareerIndabaMagazine #CareersInPractice #Leadership #AfricanEnterprise #WomenInLeadership",
    "createdAt": "Fri Jan 30 10:13:43 +0000 2026",
    "replyCount": 0,
    "retweetCount": 0,
    "likeCount": 0,
    "conversationId": "2017179411951309023",
    "author": {
      "username": "CareerIndaba",
      "name": "#Career Indaba®"
    },
    "authorId": "1185511604772839425",
    "media": [
      {
        "type": "photo",
        "url": "https://pbs.twimg.com/media/G_50zpTWUAAmH4o.jpg",
        "width": 1200,
        "height": 1200,
        "previewUrl": "https://pbs.twimg.com/media/G_50zpTWUAAmH4o.jpg:small"
      }
    ]
  },
  {
    "id": "2017162068718244012",
    "text": "#CareerPathways in #Media & #Creative Industries. Ntombi Phiri’s career journey reflects how voice, purpose, and cultural grounding can shape longevity in broadcasting.\n\nFeatured in Career Indaba® Magazine’s inaugural edition, her story traces a path defined by courage, adaptability, and responsibility to the audience and community.\n\nExplore the full feature https://t.co/a2k0cjLZPL\n\n#CareerIndabaMagazine #Media #CreativeIndustry",
    "createdAt": "Fri Jan 30 09:04:48 +0000 2026",
    "replyCount": 0,
    "retweetCount": 0,
    "likeCount": 0,
    "conversationId": "2017162068718244012",
    "author": {
      "username": "CareerIndaba",
      "name": "#Career Indaba®"
    },
    "authorId": "1185511604772839425",
    "media": [
      {
        "type": "photo",
        "url": "https://pbs.twimg.com/media/G_5mAfCXoAAuoQ1.jpg",
        "width": 1200,
        "height": 1200,
        "previewUrl": "https://pbs.twimg.com/media/G_5mAfCXoAAuoQ1.jpg:small"
      }
    ]
  },
  {
    "id": "2016548911037501952",
    "text": "#CareerPathways in building #Enterprises across sectors. Sma Mathibeli’s career reflects leadership shaped through seasons, from storytelling and communication to strategy and enterprise.\n\nFeatured in Career Indaba® Magazine’s inaugural edition, her journey highlights how rooted leadership and cultural identity can inform sustainable organisational growth. Read or listen at https://t.co/l6ltw5Q1oe\n\n#CareerIndabaMagazine #CareersInPractice #Leadership #AfricanEnterprise #WomenInLeadership",
    "createdAt": "Wed Jan 28 16:28:20 +0000 2026",
    "replyCount": 0,
    "retweetCount": 0,
    "likeCount": 0,
    "conversationId": "2016548911037501952",
    "author": {
      "username": "CareerIndaba",
      "name": "#Career Indaba®"
    },
    "authorId": "1185511604772839425",
    "media": [
      {
        "type": "video",
        "url": "https://pbs.twimg.com/amplify_video_thumb/2016548657064005640/img/Dt12ZaAh9ooaPiIx.jpg",
        "width": 720,
        "height": 1280,
        "previewUrl": "https://pbs.twimg.com/amplify_video_thumb/2016548657064005640/img/Dt12ZaAh9ooaPiIx.jpg:small",
        "videoUrl": "https://video.twimg.com/amplify_video/2016548657064005640/vid/avc1/720x1280/KxL3i1dTcYFJmR_h.mp4?tag=21",
        "durationMs": 59720
      }
    ]
  },
  {
    "id": "2016541099460854121",
    "text": "#CareerPathways in the #Health, #Wellness & #Performance sector. Reflecting on the career journey of Dr Keitumetse \"Tumi\" Mashego, Clinical and Sports Psychologist, author, and founder of RebaOne Wellness, featured in Career Indaba® Magazine’s inaugural edition.\n\nHer journey offers perspective on self-mastery as a professional discipline shaped through athletics, academia, entrepreneurship, and lived experience. It is a reminder that sustainable performance, leadership, and impact are built first in the mind, and sustained through intentional inner work.\n\nLearn more at https://t.co/av9q2TGFCP\n\n#CareerIndabaMagazine #CareerPathways #MentalHealth #PerformancePsychology #Leadership",
    "createdAt": "Wed Jan 28 15:57:18 +0000 2026",
    "replyCount": 0,
    "retweetCount": 0,
    "likeCount": 0,
    "conversationId": "2016541099460854121",
    "author": {
      "username": "CareerIndaba",
      "name": "#Career Indaba®"
    },
    "authorId": "1185511604772839425",
    "media": [
      {
        "type": "video",
        "url": "https://pbs.twimg.com/amplify_video_thumb/2016540852336603136/img/W1bzfqJBpaOB0hCV.jpg",
        "width": 720,
        "height": 1280,
        "previewUrl": "https://pbs.twimg.com/amplify_video_thumb/2016540852336603136/img/W1bzfqJBpaOB0hCV.jpg:small",
        "videoUrl": "https://video.twimg.com/amplify_video/2016540852336603136/vid/avc1/720x1280/xz3Xo3fev8pGHnrR.mp4?tag=21",
        "durationMs": 61880
      }
    ]
  },
  {
    "id": "2016537526639456462",
    "text": "#CareerPathways perspective in the #Education and #Training sector. In conversations about unemployment, skills shortages, and workforce readiness, qualifications are often referenced, yet behind every credible career pathway sits a system that determines whether learning is recognised, trusted, and transferable.\n\nThe South African Qualifications Authority @SAQALive is the custodian of the National Qualifications Framework, and how its work underpins skills recognition, employability, and mobility across South Africa’s labour market.\n\nEstablished in 1995, @SAQALive continues to play a central role in aligning education, skills development, and the world of work at a time when clarity and trust in qualifications matter more than ever. \n\nSouth African Qualifications Authority (SAQA)’s mandate is to ensure that skills are recognised, qualifications are trusted, and career pathways remain accessible within South Africa’s labour market.\n\n#CareerIndabaMagazine #CareersIntelligence #SkillsDevelopment #LabourMarket #PublicSector",
    "createdAt": "Wed Jan 28 15:43:06 +0000 2026",
    "replyCount": 0,
    "retweetCount": 0,
    "likeCount": 0,
    "conversationId": "2016537526639456462",
    "author": {
      "username": "CareerIndaba",
      "name": "#Career Indaba®"
    },
    "authorId": "1185511604772839425",
    "media": [
      {
        "type": "video",
        "url": "https://pbs.twimg.com/amplify_video_thumb/2016534462926905344/img/UueDkRvNYjSiCRTK.jpg",
        "width": 720,
        "height": 1280,
        "previewUrl": "https://pbs.twimg.com/amplify_video_thumb/2016534462926905344/img/UueDkRvNYjSiCRTK.jpg:small",
        "videoUrl": "https://video.twimg.com/amplify_video/2016534462926905344/vid/avc1/720x1280/SKMHvNG4bAjz3P2_.mp4?tag=21",
        "durationMs": 83640
      }
    ]
  },
  {
    "id": "2015885266205237646",
    "text": "#CareerPathways in the Media & ICT industry. Keneilwe Ntaolang’s journey from Ga-Rankuwa to becoming an award-winning Performance Marketing Manager at MTN is a testament to resilience and determination.\n\nRaised by strong women who taught her the value of hard work and community, Keneilwe’s career is marked by courage and reinvention. She believes in leading with heart, creating opportunities for others, and transforming teams through empathy and integrity.\n\nHer story is not just about personal success; it’s about lifting others along the way. Discover how Keneilwe’s legacy is shaping the future of leadership and inspiring the next generation to achieve the impossible.\n\nThis feature forms part of Career Indaba® Magazine’s growing digital career archive, capturing career intelligence across sectors for those navigating leadership, responsibility, and professional legacy. Watch the summary\n\nRead the full cover feature at https://t.co/W5y38xbqzd\n#CareerIndabaMagazine #CareerJourneys #Media #ICT #Leadership #CareersInAfrica",
    "createdAt": "Mon Jan 26 20:31:15 +0000 2026",
    "replyCount": 0,
    "retweetCount": 0,
    "likeCount": 0,
    "conversationId": "2015885266205237646",
    "author": {
      "username": "CareerIndaba",
      "name": "#Career Indaba®"
    },
    "authorId": "1185511604772839425",
    "media": [
      {
        "type": "video",
        "url": "https://pbs.twimg.com/amplify_video_thumb/2015885118640975872/img/yOahtuodz59aoEVZ.jpg",
        "width": 720,
        "height": 1280,
        "previewUrl": "https://pbs.twimg.com/amplify_video_thumb/2015885118640975872/img/yOahtuodz59aoEVZ.jpg:small",
        "videoUrl": "https://video.twimg.com/amplify_video/2015885118640975872/vid/avc1/720x1280/QYtup2d3ZPayCjGP.mp4?tag=21",
        "durationMs": 56960
      }
    ]
  },
  {
    "id": "2015853411669803470",
    "text": "#CareerPathways in #Engineering & #Manufacturing sector. Pinkie Portia Ngongoshe’s career journey reflects how technical careers are built through discipline, resilience, and the courage to step into spaces where representation has historically been limited.\n\nFrom Kwaggafontein in Mpumalanga to her role as a Fitter at JA Engineering Works (Pty) Ltd, her path illustrates how engineering careers are often forged through perseverance rather than privilege. Entering a male-dominated industry, Pinkie’s journey is not defined by defiance alone, but by sustained belief in her capability, commitment to learning, and respect for craft.\n\nThrough apprenticeship, technical training, and practical experience, she has built credibility in an environment where trust is earned through precision, safety, and consistency. Her career offers perspective on artisanal and technical pathways within engineering — where leadership is expressed through competence, teamwork, and accountability on the job.\n\nPinkie Portia Ngongoshe’s story forms part of Career Indaba® Magazine’s inaugural edition, contributing to a growing digital career archive that recognises careers built from the ground up, and the role of #women in shaping the future of technical industries.\n\nRead the full cover at https://t.co/oCY5JarlLF\n\n#CareerIndabaMagazine #EngineeringCareers #WomenInEngineering #ArtisanPathways #CareersInAfrica",
    "createdAt": "Mon Jan 26 18:24:40 +0000 2026",
    "replyCount": 0,
    "retweetCount": 0,
    "likeCount": 0,
    "conversationId": "2015853411669803470",
    "author": {
      "username": "CareerIndaba",
      "name": "#Career Indaba®"
    },
    "authorId": "1185511604772839425",
    "media": [
      {
        "type": "video",
        "url": "https://pbs.twimg.com/amplify_video_thumb/2015853016360890368/img/icMhdv-cdf4ELhqN.jpg",
        "width": 720,
        "height": 1280,
        "previewUrl": "https://pbs.twimg.com/amplify_video_thumb/2015853016360890368/img/icMhdv-cdf4ELhqN.jpg:small",
        "videoUrl": "https://video.twimg.com/amplify_video/2015853016360890368/vid/avc1/720x1280/nETiUskd7qdcytCc.mp4?tag=21",
        "durationMs": 43080
      }
    ]
  }
]
