[
  {
    "id": "2018512054379004088",
    "text": "RT @DanScavino: On behalf of Erin and me, thank you to everyone for the love and support we've received. We both had an unforgettable weddi…",
    "createdAt": "Tue Feb 03 02:29:10 +0000 2026",
    "replyCount": 0,
    "retweetCount": 10837,
    "likeCount": 0,
    "conversationId": "2018512054379004088",
    "author": {
      "username": "realDonaldTrump",
      "name": "Donald J. Trump"
    },
    "authorId": "25073877"
  },
  {
    "id": "2018466683707625610",
    "text": "RT @THR: Box Office: ‘Melania’ Heads for $8 Million Opening, the Best Showing in a Decade for a Doc https://t.co/2FKjEMRoxW",
    "createdAt": "Mon Feb 02 23:28:53 +0000 2026",
    "replyCount": 0,
    "retweetCount": 2812,
    "likeCount": 0,
    "conversationId": "2018466683707625610",
    "author": {
      "username": "realDonaldTrump",
      "name": "Donald J. Trump"
    },
    "authorId": "25073877"
  },
  {
    "id": "2018466659422687405",
    "text": "RT @FoxNews: RECORD BREAKER: “Melania,” a documentary following the first lady in the 20 days before President Trump’s second inauguration,…",
    "createdAt": "Mon Feb 02 23:28:47 +0000 2026",
    "replyCount": 0,
    "retweetCount": 5408,
    "likeCount": 0,
    "conversationId": "2018466659422687405",
    "author": {
      "username": "realDonaldTrump",
      "name": "Donald J. Trump"
    },
    "authorId": "25073877"
  },
  {
    "id": "2017675831116521939",
    "text": "RT @MELANIATRUMP: MELANIA, the film.\n#1 Highest Opening In 10 Yrs (Doc)\nLoved By All - “A” CinemaScore https://t.co/HTVM0Cu2Jv",
    "createdAt": "Sat Jan 31 19:06:19 +0000 2026",
    "replyCount": 0,
    "retweetCount": 10646,
    "likeCount": 0,
    "conversationId": "2017675831116521939",
    "author": {
      "username": "realDonaldTrump",
      "name": "Donald J. Trump"
    },
    "authorId": "25073877",
    "media": [
      {
        "type": "photo",
        "url": "https://pbs.twimg.com/media/HAAt9yXWIAEZY_X.jpg",
        "width": 1266,
        "height": 1600,
        "previewUrl": "https://pbs.twimg.com/media/HAAt9yXWIAEZY_X.jpg:small"
      }
    ]
  },
  {
    "id": "2017417980594827718",
    "text": "Last night I saw, “MELANIA,” for the second time. The audience loved it, and so do I. Check it out — A MUST SEE! https://t.co/rjwd5Appkv",
    "createdAt": "Sat Jan 31 02:01:43 +0000 2026",
    "replyCount": 47363,
    "retweetCount": 36583,
    "likeCount": 311252,
    "conversationId": "2017417980594827718",
    "author": {
      "username": "realDonaldTrump",
      "name": "Donald J. Trump"
    },
    "authorId": "25073877"
  },
  {
    "id": "2015833393917747502",
    "text": "MELANIA, the Movie, is a MUST WATCH. Get your tickets today — Selling out, FAST!\n\nPhoto: Regine Mahaux\nhttps://t.co/rjwd5Appkv https://t.co/vFpXfV0Mg0",
    "createdAt": "Mon Jan 26 17:05:08 +0000 2026",
    "replyCount": 64375,
    "retweetCount": 43899,
    "likeCount": 411059,
    "conversationId": "2015833393917747502",
    "author": {
      "username": "realDonaldTrump",
      "name": "Donald J. Trump"
    },
    "authorId": "25073877",
    "media": [
      {
        "type": "photo",
        "url": "https://pbs.twimg.com/media/G_mtyaXXcAAvj4V.jpg",
        "width": 868,
        "height": 1182,
        "previewUrl": "https://pbs.twimg.com/media/G_mtyaXXcAAvj4V.jpg:small"
      }
    ]
  },
  {
    "id": "2014874759473828043",
    "text": "I have been briefed on the Record Cold Wave and Historic Winter Storm that will be hitting much of the United States this weekend. The Trump Administration is coordinating with State and Local Officials. FEMA is fully prepared to respond. Stay Safe and Stay Warm! President DJT",
    "createdAt": "Sat Jan 24 01:35:51 +0000 2026",
    "replyCount": 31059,
    "retweetCount": 39499,
    "likeCount": 286888,
    "conversationId": "2014874759473828043",
    "author": {
      "username": "realDonaldTrump",
      "name": "Donald J. Trump"
    },
    "authorId": "25073877",
    "quotedTweet": {
      "id": "2014828034075803679",
      "text": "Take this storm seriously, folks.\n\nModerate to major impacts are expected from the Central US through to the Northeast today through the weekend.\n- Hazardous to impossible driving conditions are expected. Avoid travel if at all possible.\n- Widespread closures and disruption to infrastructure may also occur.\n\nStay weather aware and up to date on the latest alerts and weather conditions by following your local national weather service office on social media or checking https://t.co/qk3BcVP5M8.",
      "createdAt": "Fri Jan 23 22:30:11 +0000 2026",
      "replyCount": 1118,
      "retweetCount": 3391,
      "likeCount": 13657,
      "conversationId": "2014828034075803679",
      "author": {
        "username": "NWS",
        "name": "National Weather Service"
      },
      "authorId": "454313925",
      "media": [
        {
          "type": "photo",
          "url": "https://pbs.twimg.com/media/G_YbauLXcAAdx8t.jpg",
          "width": 2048,
          "height": 1851,
          "previewUrl": "https://pbs.twimg.com/media/G_YbauLXcAAdx8t.jpg:small"
        }
      ]
    }
  },
  {
    "id": "2014772963719991311",
    "text": "COUNTDOWN: 7 Days until the World will witness an unforgettable, behind-the-scenes, look at one of the most important events of our time.\n\nMELANIA: TWENTY DAYS TO HISTORY:\nhttps://t.co/rjwd5Appkv https://t.co/AHD0rn1M7C",
    "createdAt": "Fri Jan 23 18:51:21 +0000 2026",
    "replyCount": 39924,
    "retweetCount": 49618,
    "likeCount": 395343,
    "conversationId": "2014772963719991311",
    "author": {
      "username": "realDonaldTrump",
      "name": "Donald J. Trump"
    },
    "authorId": "25073877",
    "media": [
      {
        "type": "video",
        "url": "https://pbs.twimg.com/amplify_video_thumb/2014772905972776960/img/p2xp8bKg4wjLZqsK.jpg",
        "width": 1280,
        "height": 720,
        "previewUrl": "https://pbs.twimg.com/amplify_video_thumb/2014772905972776960/img/p2xp8bKg4wjLZqsK.jpg:small",
        "videoUrl": "https://video.twimg.com/amplify_video/2014772905972776960/vid/avc1/1280x720/m-soU3NaS1n-xyqt.mp4?tag=21",
        "durationMs": 67624
      }
    ]
  },
  {
    "id": "2004012442427277591",
    "text": "Merry Christmas to all, including the Radical Left Scum that is doing everything possible to destroy our Country, but are failing badly. We no longer have Open Borders, Men in Women’s Sports, Transgender for Everyone, or Weak Law Enforcement. What we do have is a Record Stock Market and 401K’s, Lowest Crime numbers in decades, No Inflation, and yesterday, a 4.3 GDP, two points better than expected. Tariffs have given us Trillions of Dollars in Growth and Prosperity, and the strongest National Security we have ever had. We are respected again, perhaps like never before. God Bless America!!! President DJT",
    "createdAt": "Thu Dec 25 02:12:53 +0000 2025",
    "replyCount": 110759,
    "retweetCount": 89524,
    "likeCount": 803282,
    "conversationId": "2004012442427277591",
    "author": {
      "username": "realDonaldTrump",
      "name": "Donald J. Trump"
    },
    "authorId": "25073877"
  },
  {
    "id": "2003565251816554746",
    "text": "THE TRUMP KENNEDY CENTER HONORS will be broadcast tonight, on CBS, and Stream on Paramount+. Tune in at 8 P.M. EST! At the request of the Board, and just about everybody else in America, I am hosting the event. Tell me what you think of my “Master of Ceremony” abilities. If really good, would you like me to leave the Presidency in order to make “hosting” a full time job? We will be honoring true GREATS in the History of Entertainment: Sylvester Stallone, Michael Crawford, KISS, George Strait, and Gloria Gaynor.",
    "createdAt": "Tue Dec 23 20:35:55 +0000 2025",
    "replyCount": 30094,
    "retweetCount": 22278,
    "likeCount": 166045,
    "conversationId": "2003565251816554746",
    "author": {
      "username": "realDonaldTrump",
      "name": "Donald J. Trump"
    },
    "authorId": "25073877"
  },
  {
    "id": "1995898845134303294",
    "text": "I am asking all America First Patriots in Tennessee’s 7th Congressional District to please GET OUT AND VOTE for a phenomenal Candidate and MAGA Warrior, Matt Van Epps! You can win this Election for Matt, who has my Complete and Total Endorsement. HE WILL BE A GREAT CONGRESSMAN and, unlike his Opponent, he cherishes Christianity and Country Music — She has openly stated that she hates them both!\n \nTN-07: Polls close at 7:00 P.M. IF YOU ARE IN LINE BY 7 P.M., STAY IN LINE, AND THEY MUST LET YOU VOTE. GET OUT AND VOTE, VOTE, VOTE FOR MATT VAN EPPS — HE WILL NEVER LET YOU DOWN!\n \nFind your voting location and hours at: https://t.co/saCiO9NLKx",
    "createdAt": "Tue Dec 02 16:52:21 +0000 2025",
    "replyCount": 33593,
    "retweetCount": 30297,
    "likeCount": 154501,
    "conversationId": "1995898845134303294",
    "author": {
      "username": "realDonaldTrump",
      "name": "Donald J. Trump"
    },
    "authorId": "25073877"
  },
  {
    "id": "1995676855651664182",
    "text": "I am asking all America First Patriots in Tennessee’s 7th Congressional District to please GET OUT AND VOTE TOMORROW for a phenomenal Candidate, Matt Van Epps, on Election Day, Tuesday, December 2nd! You can win this Election for MAGA Warrior Matt Van Epps, who has my Complete and Total Endorsement. HE WILL BE A GREAT CONGRESSMAN and, unlike his Opponent, he cherishes Christianity and Country Music — She has openly stated that she hates them both!\n \nTN-07: Polls open in all Counties no later than 9:00 A.M., but some open as early as 7:00 A.M. Polls close at 7:00 P.M. IF YOU ARE IN LINE BY 7 P.M., STAY IN LINE, AND THEY MUST LET YOU VOTE! Election Day is TOMORROW, December 2nd. GET OUT AND VOTE, VOTE, VOTE FOR MATT VAN EPPS — HE WILL NEVER LET YOU DOWN!\n \nFind your voting location and hours at:\nhttps://t.co/saCiO9NLKx",
    "createdAt": "Tue Dec 02 02:10:14 +0000 2025",
    "replyCount": 16787,
    "retweetCount": 34608,
    "likeCount": 164718,
    "conversationId": "1995676855651664182",
    "author": {
      "username": "realDonaldTrump",
      "name": "Donald J. Trump"
    },
    "authorId": "25073877"
  },
  {
    "id": "1994760100376891748",
    "text": "To all Airlines, Pilots, Drug Dealers, and Human Traffickers, please consider THE AIRSPACE ABOVE AND SURROUNDING VENEZUELA TO BE CLOSED IN ITS ENTIRETY. Thank you for your attention to this matter! PRESIDENT DONALD J. TRUMP",
    "createdAt": "Sat Nov 29 13:27:23 +0000 2025",
    "replyCount": 39385,
    "retweetCount": 77207,
    "likeCount": 598358,
    "conversationId": "1994760100376891748",
    "author": {
      "username": "realDonaldTrump",
      "name": "Donald J. Trump"
    },
    "authorId": "25073877"
  },
  {
    "id": "1994438728237064270",
    "text": "The United States did not attend the G20 in South Africa, because the South African Government refuses to acknowledge or address the horrific Human Right Abuses endured by Afrikaners, and other descendants of Dutch, French, and German settlers. To put it more bluntly, they are killing white people, and randomly allowing their farms to be taken from them. Perhaps, worst of all, the soon to be out of business New York Times and the Fake News Media won’t issue a word against this genocide. That’s why all the Liars and Pretenders of the Radical Left Media are going out of business! At the conclusion of the G20, South Africa refused to hand off the G20 Presidency to a Senior Representative from our U.S. Embassy, who attended the Closing Ceremony. Therefore, at my direction, South Africa will NOT be receiving an invitation to the 2026 G20, which will be hosted in the Great City of Miami, Florida next year. South Africa has demonstrated to the World they are not a country worthy of Membership anywhere, and we are going to stop all payments and subsidies to them, effective immediately. Thank you for your attention to this matter!",
    "createdAt": "Fri Nov 28 16:10:22 +0000 2025",
    "replyCount": 38462,
    "retweetCount": 76268,
    "likeCount": 526453,
    "conversationId": "1994438728237064270",
    "author": {
      "username": "realDonaldTrump",
      "name": "Donald J. Trump"
    },
    "authorId": "25073877"
  },
  {
    "id": "1994438342403141889",
    "text": "Democracy is on trial in the coming Elections in the beautiful country of Honduras on November 30th. Will Maduro and his Narcoterrorists take over another country like they have taken over Cuba, Nicaragua, and Venezuela? The man who is standing up for Democracy, and fighting against Maduro, is Tito Asfura, the Presidential Candidate of the National Party. Tito was the highly successful Mayor of Tegucigalpa where he brought running water to millions, and paved hundreds of kilometers of roads. His chief opponent is Rixi Moncada, who says Fidel Castro is her idol. Normally, the smart people of Honduras, would reject her, and elect Tito Asfura, but the Communists are trying to trick the people by running a third Candidate, Salvador Nasralla. Nasralla is no friend of Freedom. A borderline Communist, he helped Xiomara Castro by running as her Vice President. He won, and helped Castro win. Then he resigned, and is now pretending to be an anti-Communist only for the purposes of splitting Asfura’s vote. The people of Honduras must not be tricked again. The only real friend of Freedom in Honduras is Tito Asfura. Tito and I can work together to fight the Narcocommunists, and bring needed aid to the people of Honduras. I cannot work with Moncada and the Communists, and Nasralla is not a reliable partner for Freedom, and cannot be trusted. I hope the people of Honduras vote for Freedom and Democracy, and elect Tito Asfura, President!",
    "createdAt": "Fri Nov 28 16:08:50 +0000 2025",
    "replyCount": 13869,
    "retweetCount": 32341,
    "likeCount": 199403,
    "conversationId": "1994438342403141889",
    "author": {
      "username": "realDonaldTrump",
      "name": "Donald J. Trump"
    },
    "authorId": "25073877"
  },
  {
    "id": "1994272683387687053",
    "text": "A very Happy Thanksgiving salutation to all of our Great American Citizens and Patriots who have been so nice in allowing our Country to be divided, disrupted, carved up, murdered, beaten, mugged, and laughed at, along with certain other foolish countries throughout the World, for being “Politically Correct,” and just plain STUPID, when it comes to Immigration. The official United States Foreign population stands at 53 million people (Census), most of which are on welfare, from failed nations, or from prisons, mental institutions, gangs, or drug cartels. They and their children are supported through massive payments from Patriotic American Citizens who, because of their beautiful hearts, do not want to openly complain or cause trouble in any way, shape, or form. They put up with what has happened to our Country, but it’s eating them alive to do so! A migrant earning $30,000 with a green card will get roughly $50,000 in yearly benefits for their family. The real migrant population is much higher. This refugee burden is the leading cause of social dysfunction in America, something that did not exist after World War II (Failed schools, high crime, urban decay, overcrowded hospitals, housing shortages, and large deficits, etc.). As an example, hundreds of thousands of refugees from Somalia are completely taking over the once great State of Minnesota. Somalian gangs are roving the streets looking for “prey” as our wonderful people stay locked in their apartments and houses hoping against hope that they will be left alone. The seriously retarded Governor of Minnesota, Tim Walz, does nothing, either through fear, incompetence, or both, while the worst “Congressman/woman” in our Country, Ilhan Omar, always wrapped in her swaddling hijab, and who probably came into the U.S.A. illegally in that you are not allowed to marry your brother, does nothing but hatefully complain about our Country, its Constitution, and how “badly” she is treated, when her place of origin is a decadent, backward, and crime ridden nation, which is essentially not even a country for lack of Government, Military, Police, schools, etc. Even as we have progressed technologically, Immigration Policy has eroded those gains and living conditions for many. I will permanently pause migration from all Third World Countries to allow the U.S. system to fully recover, terminate all of the millions of Biden illegal admissions, including those signed by Sleepy Joe Biden’s Autopen, and remove anyone who is not a net asset to the United States, or is incapable of loving our Country, end all Federal benefits and subsidies to noncitizens of our Country, denaturalize migrants who undermine domestic tranquility, and deport any Foreign National who is a public charge, security risk, or non-compatible with Western Civilization. These goals will be pursued with the aim of achieving a major reduction in illegal and disruptive populations, including those admitted through an unauthorized and illegal Autopen approval process. Only REVERSE MIGRATION can fully cure this situation. Other than that, HAPPY THANKSGIVING TO ALL, except those that hate, steal, murder, and destroy everything that America stands for — You won’t be here for long!",
    "createdAt": "Fri Nov 28 05:10:34 +0000 2025",
    "replyCount": 41978,
    "retweetCount": 81867,
    "likeCount": 545940,
    "conversationId": "1994272683387687053",
    "author": {
      "username": "realDonaldTrump",
      "name": "Donald J. Trump"
    },
    "authorId": "25073877"
  },
  {
    "id": "1993801758326616561",
    "text": "https://t.co/oQK0HLgf88",
    "createdAt": "Wed Nov 26 21:59:16 +0000 2025",
    "replyCount": 24506,
    "retweetCount": 52503,
    "likeCount": 432783,
    "conversationId": "1993801758326616561",
    "author": {
      "username": "realDonaldTrump",
      "name": "Donald J. Trump"
    },
    "authorId": "25073877",
    "media": [
      {
        "type": "photo",
        "url": "https://pbs.twimg.com/media/G6toIexXAAAuXuy.jpg",
        "width": 1319,
        "height": 916,
        "previewUrl": "https://pbs.twimg.com/media/G6toIexXAAAuXuy.jpg:small"
      }
    ]
  },
  {
    "id": "1993469230528790869",
    "text": "I am asking all America First Patriots in Tennessee’s 7th Congressional District, who haven’t voted yet, to please GET OUT AND VOTE for MAGA Warrior Matt Van Epps, tomorrow, November 26th, the last day to vote early in person. You can win this Election for Matt! PLEASE VOTE FOR MATT VAN EPPS, who has my Complete and Total Endorsement. Polls close at 12 P.M. NOON in most of TN-07, and every vote counts. IF YOU ARE IN LINE BY 12 P.M., STAY IN LINE, AND THEY MUST LET YOU VOTE! TN-07: Early Voting ends November 26th, and Election Day is December 2nd. GET OUT AND VOTE FOR MATT VAN EPPS — HE WILL NEVER LET YOU DOWN!\n \nFind your Early Voting location at: https://t.co/saCiO9NLKx",
    "createdAt": "Tue Nov 25 23:57:56 +0000 2025",
    "replyCount": 16666,
    "retweetCount": 38274,
    "likeCount": 167694,
    "conversationId": "1993469230528790869",
    "author": {
      "username": "realDonaldTrump",
      "name": "Donald J. Trump"
    },
    "authorId": "25073877"
  },
  {
    "id": "1978283219461030105",
    "text": "RT @kaitrump: I had an amazing time filming with my Grandpa to kick off my new series called 1 on 1 with Kai. In the video, everyone gets t…",
    "createdAt": "Wed Oct 15 02:14:08 +0000 2025",
    "replyCount": 0,
    "retweetCount": 17151,
    "likeCount": 0,
    "conversationId": "1978283219461030105",
    "author": {
      "username": "realDonaldTrump",
      "name": "Donald J. Trump"
    },
    "authorId": "25073877"
  },
  {
    "id": "1978148814776046046",
    "text": "Don’t forget to get a copy of my son Eric’s book, “UNDER SIEGE,” which is breaking records everywhere. It’s a phenomenal book, that’s a must read for everyone—Congratulations Eric, you deserve it!!! https://t.co/na0jBJ1nxp https://t.co/jUtJ6xrP5P",
    "createdAt": "Tue Oct 14 17:20:04 +0000 2025",
    "replyCount": 78061,
    "retweetCount": 51941,
    "likeCount": 385593,
    "conversationId": "1978148814776046046",
    "author": {
      "username": "realDonaldTrump",
      "name": "Donald J. Trump"
    },
    "authorId": "25073877",
    "media": [
      {
        "type": "photo",
        "url": "https://pbs.twimg.com/media/G3PL3OzXoAEjS8T.jpg",
        "width": 1618,
        "height": 1618,
        "previewUrl": "https://pbs.twimg.com/media/G3PL3OzXoAEjS8T.jpg:small"
      }
    ]
  }
]
